var data=[];
var dataStr='1、这个杀手不太冷<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
2、东成西就<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
3、哈利机长<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
4、罗马假日<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
5、泰坦尼克号<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
6、敢死队<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
7、威尼斯水怪<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
8、破产姐妹<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
9、加勒比海盗<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
10、末代皇帝<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
11、大话西游<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
12、赌神<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
13、功夫<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
14、倩女幽魂<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
15、无间道<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
16、2012<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
17、鸡毛信<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
18、幸福人生<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
19、圣诞传说<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
<br>\
<br>\
20、喜剧之王<br>\
<br>\
导演：彼得杰克逊<br>\
编剧：弗兰 /<br>\
主演：马丁/ 杰克逊/ 柯里/ 约翰<br>\
类型：动作 /奇幻 /冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23 (中国大陆)<br>\
片长：166分钟<br>\
';
var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
  var c = d[i].split('<br><br>');
   data.push({
     img:c[0].replace('、',' ')+'.jpg',
     caption:c[0].split('、')[1],
     desc:c[1]
   });
   console.log(c[0].replace('、',' ')+'.jpg');
}